{"date":"August 19, 2012",

"title":"Summer Update",

"content":"<p>Hey Jersey Fans!</p><p>Mike has been training hard this summer, working on qualifying the jumps he will perform this winter.  With the end of the 2012 London Olympics, we are very conscious that only 17 months remain until the 2014 Olympics in Sochi, Russia! </p><p>In May, Mike decided to move back out to Park City, UT, to train with the rest of the US Freestyle Aerials team, leaving behind Bergy and the development team, not to mention the Olympic Training Center and Lake Placid, his home for the last 2 years.  It has been a very positive move. The combination of US coaches Todd Ossian, Matt Saunders and Joe Davies, the trampolines and workout rooms at the Center of Excellence, and the commitment of the trainers, physical therapists and support staff of the US Ski Team have, if possible, accelerated Mike's improvement and advancement with his jumping.  He is working on qualifying 2 big triples, Lay-Double Full-Full and Full-Double Full-Full, for the winter competition season.</p><p>In addition to training and finishing up his senior year of online high school, Mike has been performing in the Flying Ace All Stars water ramp shows at the Utah Olympic Park.  He jumps in the public shows on Saturdays, and has also performed in a number of private shows.  Mike jumped in the show for Mitt Romney and his supporters during the Republicans' Park City weekend in June, and also performed in the Hurricane for Hope, a huge fundraiser for <a href=\"http://thespeedyfoundation.org/\">the Speedy Foundation</a>, in August.  Many of these private shows at night feature pyrotechnics. Mike says it's pretty exciting going off the triple with fireworks exploding at the sides of the ramp!</p><p>Mike and Mac Bohonnon share a condo conveniently located 1/4-mile from Lou and Tracie's, and less than 5 miles from the Utah Olympic Park water ramp site. He is very happy with the little Honda Civic we bought this spring, getting over 35 miles per gallon.  It was also the car that got Mike and most of his stuff out to Park City!</p><p>That's all the news for now!  Thanks for all of your support!</p><p>Love, Bill and Barb</p><p>Go Jersey Mike!</p>"}
